Reports/Renault_ДополнительныеПродажиСервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>Renault_ДополнительныеПродажиСервиса</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/Renault_СоставРаботПоЭтапам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СоставРаботПоЭтапам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтоРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаботаЗапчасть</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/Renault_ДополнительныеПродажиСервиса/Ext/ObjectModule.bsl
Функция мСформировать(Подразделение = Неопределено, ВидРемонта = Неопределено, ДатаНачала, ДатаОкончания) Экспорт

	ТабДок = Новый ТабличныйДокумент;
	
	Запрос =  Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд КАК Документ,
	               |	Renault_ПродажиСервиса.Сотрудник,
	               |	Renault_ПродажиСервиса.РаботаЗапчасть,
	               |	СУММА(Renault_ПродажиСервиса.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТЭтап1
	               |ИЗ
	               |	РегистрСведений.Renault_СоставРаботПоЭтапам КАК Renault_ПродажиСервиса
	               |ГДЕ
	               |	Renault_ПродажиСервиса.Этап = 1
	               |	И Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд <> ЗНАЧЕНИЕ(Документ.ЗаказНаряд.ПустаяСсылка)
	               |	И // Условие период //
				   |	И // Условие вид ремонта // 
				   |	И // Условие Подразделение // 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд,
	               |	Renault_ПродажиСервиса.Сотрудник,
	               |	Renault_ПродажиСервиса.РаботаЗапчасть
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд КАК Документ,
	               |	Renault_ПродажиСервиса.Сотрудник,
	               |	Renault_ПродажиСервиса.РаботаЗапчасть,
	               |	СУММА(Renault_ПродажиСервиса.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТЭтап2
	               |ИЗ
	               |	РегистрСведений.Renault_СоставРаботПоЭтапам КАК Renault_ПродажиСервиса
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТЭтап1.Документ КАК Документ
	               |		ИЗ
	               |			ВТЭтап1 КАК ВТЭтап1
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТЭтап1.Документ) КАК ДокументыЗаказНаряд
	               |		ПО Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд = ДокументыЗаказНаряд.Документ
	               |			И (Renault_ПродажиСервиса.Этап = 2)
				   |			И (// Условие Подразделение // )
				   |			И (// Условие период // )
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд,
	               |	Renault_ПродажиСервиса.Сотрудник,
	               |	Renault_ПродажиСервиса.РаботаЗапчасть
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд КАК Документ,
	               |	Renault_ПродажиСервиса.Сотрудник,
	               |	Renault_ПродажиСервиса.РаботаЗапчасть,
	               |	СУММА(Renault_ПродажиСервиса.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТЭтап3
	               |ИЗ
	               |	РегистрСведений.Renault_СоставРаботПоЭтапам КАК Renault_ПродажиСервиса
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВТЭтап2.Документ КАК Документ
	               |		ИЗ
	               |			ВТЭтап2 КАК ВТЭтап2
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВТЭтап2.Документ) КАК ДокументыЗаказНаряд
	               |		ПО Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд = ДокументыЗаказНаряд.Документ
	               |			И (Renault_ПродажиСервиса.Этап = 3)
				   |			И (// Условие Подразделение // )
				   |			И (// Условие период // )
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Renault_ПродажиСервиса.ЗаявкаНаСервис.ЗаказНаряд,
	               |	Renault_ПродажиСервиса.Сотрудник,
	               |	Renault_ПродажиСервиса.РаботаЗапчасть
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Документ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТЭтап1.Документ, ВТЭтап2.Документ) КАК Документ,
	               |	ЕСТЬNULL(ВТЭтап1.Сотрудник, ВТЭтап2.Сотрудник) КАК Сотрудник,
	               |	ЕСТЬNULL(ВТЭтап1.РаботаЗапчасть, ВТЭтап2.РаботаЗапчасть) КАК РаботаЗапчасть,
	               |	ВЫБОР
	               |		КОГДА НЕ ВТЭтап1.Документ ЕСТЬ NULL 
	               |				И НЕ ВТЭтап2.Документ ЕСТЬ NULL 
	               |			ТОГДА ВТЭтап1.Сумма + (ВТЭтап2.Сумма - ВТЭтап1.Сумма)
	               |		КОГДА ВТЭтап1.Документ ЕСТЬ NULL 
	               |				И НЕ ВТЭтап2.Документ ЕСТЬ NULL 
	               |			ТОГДА ВТЭтап2.Сумма
	               |		КОГДА НЕ ВТЭтап1.Документ ЕСТЬ NULL 
	               |				И ВТЭтап2.Документ ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма,
	               |	ВЫБОР
	               |		КОГДА НЕ ВТЭтап1.Документ ЕСТЬ NULL 
	               |				И НЕ ВТЭтап2.Документ ЕСТЬ NULL 
	               |			ТОГДА ВТЭтап2.Сумма - ВТЭтап1.Сумма
	               |		КОГДА ВТЭтап1.Документ ЕСТЬ NULL 
	               |				И НЕ ВТЭтап2.Документ ЕСТЬ NULL 
	               |			ТОГДА ВТЭтап2.Сумма
	               |		КОГДА НЕ ВТЭтап1.Документ ЕСТЬ NULL 
	               |				И ВТЭтап2.Документ ЕСТЬ NULL 
	               |			ТОГДА -ВТЭтап1.Сумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СуммаЭтап2
	               |ПОМЕСТИТЬ ВТПодготовкаЭтап2
	               |ИЗ
	               |	ВТЭтап1 КАК ВТЭтап1
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТЭтап2 КАК ВТЭтап2
	               |		ПО ВТЭтап1.Документ = ВТЭтап2.Документ
	               |			И ВТЭтап1.РаботаЗапчасть = ВТЭтап2.РаботаЗапчасть
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЭтап1.Документ КАК Документ,
	               |	ПРЕДСТАВЛЕНИЕ(ВТЭтап1.Документ) КАК ДокументПредставление,
	               |	ВТЭтап1.Сотрудник КАК Сотрудник,
	               |	ПРЕДСТАВЛЕНИЕ(ВТЭтап1.Сотрудник) КАК СотрудникПредставление,
	               |	ВТЭтап1.РаботаЗапчасть КАК РаботаЗапчасть,
	               |	ПРЕДСТАВЛЕНИЕ(ВТЭтап1.РаботаЗапчасть) КАК РаботаЗапчастьПредставление,
	               |	ВТЭтап1.Сумма КАК Сумма
	               |ИЗ
	               |	ВТЭтап1 КАК ВТЭтап1
	               |ГДЕ
	               |	ВТЭтап1.Сумма <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Документ,
	               |	РаботаЗапчасть
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	Сотрудник,
	               |	Документ
	               |АВТОУПОРЯДОЧИВАНИЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТПодготовкаЭтап2.Документ КАК Документ,
	               |	ПРЕДСТАВЛЕНИЕ(ВТПодготовкаЭтап2.Документ) КАК ДокументПредставление,
	               |	ВТПодготовкаЭтап2.Сотрудник КАК Сотрудник,
	               |	ПРЕДСТАВЛЕНИЕ(ВТПодготовкаЭтап2.Сотрудник) КАК СотрудникПредставление,
	               |	ВТПодготовкаЭтап2.РаботаЗапчасть КАК РаботаЗапчасть,
	               |	ПРЕДСТАВЛЕНИЕ(ВТПодготовкаЭтап2.РаботаЗапчасть) КАК РаботаЗапчастьПредставление,
	               |	ВТПодготовкаЭтап2.СуммаЭтап2 КАК Сумма,
	               |	ВТПодготовкаЭтап2.Сумма КАК СуммаОбщ
	               |ИЗ
	               |	ВТПодготовкаЭтап2 КАК ВТПодготовкаЭтап2
	               |ГДЕ
	               |	ВТПодготовкаЭтап2.СуммаЭтап2 <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Документ,
	               |	РаботаЗапчасть
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	Сотрудник,
	               |	Документ
	               |АВТОУПОРЯДОЧИВАНИЕ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТЭтап3.Документ, Этап2.Документ) КАК Документ,
	               |	ЕСТЬNULL(ВТЭтап3.Сотрудник, Этап2.Сотрудник) КАК Сотрудник,
	               |	ЕСТЬNULL(ВТЭтап3.РаботаЗапчасть, Этап2.РаботаЗапчасть) КАК РаботаЗапчасть,
	               |	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТЭтап3.Документ, Этап2.Документ)) КАК ДокументПредставление,
	               |	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТЭтап3.Сотрудник, Этап2.Сотрудник)) КАК СотрудникПредставление,
	               |	ПРЕДСТАВЛЕНИЕ(ЕСТЬNULL(ВТЭтап3.РаботаЗапчасть, Этап2.РаботаЗапчасть)) КАК РаботаЗапчастьПредставление,
	               |	ВЫБОР
	               |		КОГДА НЕ Этап2.Документ ЕСТЬ NULL 
	               |				И НЕ ВТЭтап3.Документ ЕСТЬ NULL 
	               |			ТОГДА ВТЭтап3.Сумма - Этап2.Сумма
	               |		КОГДА Этап2.Документ ЕСТЬ NULL 
	               |				И НЕ ВТЭтап3.Документ ЕСТЬ NULL 
	               |			ТОГДА ВТЭтап3.Сумма
	               |		КОГДА НЕ Этап2.Документ ЕСТЬ NULL 
	               |				И ВТЭтап3.Документ ЕСТЬ NULL 
	               |			ТОГДА -Этап2.Сумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сумма
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТПодготовкаЭтап2.Документ КАК Документ,
	               |		ВТПодготовкаЭтап2.Сотрудник КАК Сотрудник,
	               |		ВТПодготовкаЭтап2.РаботаЗапчасть КАК РаботаЗапчасть,
	               |		ВТПодготовкаЭтап2.Сумма КАК Сумма
	               |	ИЗ
	               |		ВТПодготовкаЭтап2 КАК ВТПодготовкаЭтап2
	               |	ГДЕ
	               |		ВТПодготовкаЭтап2.Сумма <> 0) КАК Этап2
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ВТЭтап3 КАК ВТЭтап3
	               |		ПО Этап2.Документ = ВТЭтап3.Документ
	               |			И Этап2.РаботаЗапчасть = ВТЭтап3.РаботаЗапчасть
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ Этап2.Документ ЕСТЬ NULL 
	               |					И НЕ ВТЭтап3.Документ ЕСТЬ NULL 
	               |				ТОГДА ВТЭтап3.Сумма - Этап2.Сумма
	               |			КОГДА Этап2.Документ ЕСТЬ NULL 
	               |					И НЕ ВТЭтап3.Документ ЕСТЬ NULL 
	               |				ТОГДА ВТЭтап3.Сумма
	               |			КОГДА НЕ Этап2.Документ ЕСТЬ NULL 
	               |					И ВТЭтап3.Документ ЕСТЬ NULL 
	               |				ТОГДА -Этап2.Сумма
	               |			ИНАЧЕ 0
	               |		КОНЕЦ <> 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Сотрудник,
	               |	Документ,
	               |	РаботаЗапчасть
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	Сотрудник,
	               |	Документ
	               |АВТОУПОРЯДОЧИВАНИЕ";

	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);			   
		Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Условие период //", "Renault_ПродажиСервиса.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Условие период //", "Истина");
	КонецЕсли;			   
				   
	Если ЗначениеЗаполнено(ВидРемонта) Тогда
		Запрос.УстановитьПараметр("ВидРемонта", ВидРемонта);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Условие вид ремонта //", "Renault_ПродажиСервиса.ЗаявкаНаСервис.ВидРемонта = &ВидРемонта");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Условие вид ремонта //", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Условие Подразделение //", "Renault_ПродажиСервиса.Сотрудник.Подразделение = &Подразделение");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "// Условие Подразделение //", "Истина");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.ВыполнитьПакет();				   
	
	Этап1Результат = Результат[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Этап2Результат = Результат[5].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Этап3Результат = Результат[6].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСотрудник = Макет.ПолучитьОбласть("ГруппировкаСотрудник");
	ОбластьДокумент = Макет.ПолучитьОбласть("ГруппировкаДокумент");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Для каждого стрСотрудник Из Этап1Результат.Строки Цикл
		
		ОбластьСотрудник.Параметры.Сотрудник = стрСотрудник.СотрудникПредставление;
		ОбластьСотрудник.Параметры.Этап1Сумма = стрСотрудник.Сумма;
		
		СтрокиЭтап2 = Этап2Результат.Строки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник.Сотрудник));
		Если СтрокиЭтап2.Количество() > 0 Тогда
			ОбластьСотрудник.Параметры.Этап2Сумма = СтрокиЭтап2[0].Сумма;
		Иначе
			ОбластьСотрудник.Параметры.Этап2Сумма = 0;
		КонецЕсли;
		
		СтрокиЭтап3 = Этап3Результат.Строки.НайтиСтроки(Новый Структура("Сотрудник", стрСотрудник.Сотрудник));
		Если СтрокиЭтап3.Количество() > 0 Тогда
			ОбластьСотрудник.Параметры.Этап3Сумма = СтрокиЭтап3[0].Сумма;
		Иначе
			ОбластьСотрудник.Параметры.Этап3Сумма = 0;
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСотрудник, стрСотрудник.Уровень());
		
		Для каждого стрДокумент Из стрСотрудник.Строки Цикл
			
			ОбластьДокумент.Параметры.Сотрудник = стрСотрудник.СотрудникПредставление;
			ОбластьДокумент.Параметры.Документ = стрДокумент.ДокументПредставление;
			ОбластьДокумент.Параметры.Этап1Сумма = стрДокумент.Сумма;
			
			Если СтрокиЭтап2.Количество() > 0 Тогда
				СтрокиЭтап2Документ = СтрокиЭтап2[0].Строки.НайтиСтроки(Новый Структура("Документ", стрДокумент.Документ));
				Если СтрокиЭтап2Документ.Количество() > 0 Тогда
					ОбластьДокумент.Параметры.Этап2Сумма = СтрокиЭтап2Документ[0].Сумма;
				Иначе
					ОбластьДокумент.Параметры.Этап2Сумма = 0;
				КонецЕсли;
			Иначе
				ОбластьДокумент.Параметры.Этап2Сумма = 0;
			КонецЕсли;
			
			Если СтрокиЭтап3.Количество() > 0 Тогда
				СтрокиЭтап3Документ = СтрокиЭтап3[0].Строки.НайтиСтроки(Новый Структура("Документ", стрДокумент.Документ));
				Если СтрокиЭтап3Документ.Количество() > 0 Тогда
					ОбластьДокумент.Параметры.Этап3Сумма = СтрокиЭтап3Документ[0].Сумма;
				Иначе
					ОбластьДокумент.Параметры.Этап3Сумма = 0;
				КонецЕсли;
			Иначе	
				ОбластьДокумент.Параметры.Этап3Сумма = 0;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьДокумент, стрДокумент.Уровень());
			
			СписокРабот = Новый Соответствие;
			Для каждого стрРабота Из стрДокумент.Строки Цикл
				СписокРабот.Вставить(стрРабота.РаботаЗапчасть, стрРабота.РаботаЗапчастьПредставление);
			КонецЦикла;
			
			Если СтрокиЭтап2Документ <> Неопределено
				И СтрокиЭтап2Документ.Количество() > 0 Тогда
			
				Для каждого стрРабота Из СтрокиЭтап2Документ[0].Строки Цикл
					Если СписокРабот.Получить(стрРабота.РаботаЗапчасть) = Неопределено Тогда
						СписокРабот.Вставить(стрРабота.РаботаЗапчасть, стрРабота.РаботаЗапчастьПредставление);
					КонецЕсли;
				КонецЦикла;
			
			КонецЕсли;
			Если СтрокиЭтап3Документ <> Неопределено
				И СтрокиЭтап3Документ.Количество() > 0 Тогда
				
				Для каждого стрРабота Из СтрокиЭтап3Документ[0].Строки Цикл
					Если СписокРабот.Получить(стрРабота.РаботаЗапчасть) = Неопределено Тогда
						СписокРабот.Вставить(стрРабота.РаботаЗапчасть, стрРабота.РаботаЗапчастьПредставление);
					КонецЕсли;
				КонецЦикла;
			
			КонецЕсли;
			
			Для каждого КлючЗначение Из СписокРабот Цикл
				
				ОбластьДетальныхЗаписей.Параметры.РаботаЗапчасть = КлючЗначение.Значение;
				ОбластьДетальныхЗаписей.Параметры.РаботаЗапчастьСсылка = КлючЗначение.Ключ;
				ОбластьДетальныхЗаписей.Параметры.Сотрудник = стрСотрудник.СотрудникПредставление;
				ОбластьДетальныхЗаписей.Параметры.СотрудникСсылка = стрСотрудник.Сотрудник ;
				ОбластьДетальныхЗаписей.Параметры.Документ = стрДокумент.ДокументПредставление;
				ОбластьДетальныхЗаписей.Параметры.ДокументСсылка = стрДокумент.Документ;
				
				Строки = стрДокумент.Строки.НайтиСтроки(Новый Структура("РаботаЗапчасть", КлючЗначение.Ключ));
				Если Строки.Количество() > 0 Тогда
					ОбластьДетальныхЗаписей.Параметры.Этап1Сумма = Строки[0].Сумма;
				Иначе	
					ОбластьДетальныхЗаписей.Параметры.Этап1Сумма = 0;
				КонецЕсли;
				
				Если СтрокиЭтап2Документ <> Неопределено
					И СтрокиЭтап2Документ.Количество() > 0 Тогда
					
					Строки = СтрокиЭтап2Документ[0].Строки.НайтиСтроки(Новый Структура("РаботаЗапчасть", КлючЗначение.Ключ));
					Если Строки.Количество() > 0 Тогда
						ОбластьДетальныхЗаписей.Параметры.Этап2Сумма = Строки[0].Сумма;
					Иначе
						ОбластьДетальныхЗаписей.Параметры.Этап2Сумма = 0;
					КонецЕсли;
				Иначе
					ОбластьДетальныхЗаписей.Параметры.Этап2Сумма = 0;	
				КонецЕсли;
				
				Если СтрокиЭтап3Документ <> Неопределено
					И СтрокиЭтап3Документ.Количество() > 0 Тогда
					
					Строки = СтрокиЭтап3Документ[0].Строки.НайтиСтроки(Новый Структура("РаботаЗапчасть", КлючЗначение.Ключ));
					Если Строки.Количество() > 0 Тогда
						ОбластьДетальныхЗаписей.Параметры.Этап3Сумма = Строки[0].Сумма;
					Иначе
						ОбластьДетальныхЗаписей.Параметры.Этап3Сумма = 0;
					КонецЕсли;
				Иначе
					ОбластьДетальныхЗаписей.Параметры.Этап3Сумма = 0;	
				КонецЕсли;
				
				ТабДок.Вывести(ОбластьДетальныхЗаписей, стрДокумент.Уровень()+1);
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
	ТабДок.ПоказатьУровеньГруппировокСтрок(0);
	//ТабДок.Вывести(ОбластьПодвалТаблицы);
	//ТабДок.Вывести(ОбластьПодвал);
	
	Возврат ТабДок;
				   
КонецФункции
